package com.example.myapplication;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;

import java.util.ArrayList;

public class MainActivity extends AppCompatActivity {
ArrayList<Hadeeth> Ahadeth = new ArrayList<>();
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        Hadeeth h1 = new Hadeeth( "قال رسول الله صلى الله عليه وسلم: (إِذَا مَاتَ الإنْسَانُ انْقَطَعَ عنْه عَمَلُهُ إِلَّا مِن ثَلَاثَةٍ: إِلَّا مِن صَدَقَةٍ جَارِيَةٍ، أَوْ عِلْمٍ يُنْتَفَعُ بِهِ، أَوْ وَلَدٍ صَالِحٍ يَدْعُو له)." +

                "","يُبَيِّنُ النَّبِيُّ صلَّى الله عليه وسلَّم أنَّه إذا ماتَ الإنسانُ انقطعَ عنه عملُه؛ فَلا يَصلُ إليه أجْرٌ وثوابٌ مِن شيءٍ مِن عملِه، إلَّا مِن ثلاثةٍ، أي: مِن ثلاثةِ أشياءَ؛ فإنَّ فَائدتَها لا تنقطعُ عنه، أوَّلُها: الصَّدقَةُ الجاريةُ: وهي الَّتي يَجري نفعُها فَيدومُ أجْرُها، ثانيها: عِلْمٌ يُنتفَعُ به، أي: بَعْدَ موتِه، وقَيَّدَ العلِمَ بِالمنتَفَعِ به؛ لأنَّ العِلمَ غَيرَ المنتفَعِ به لا يُؤتَى صاحبُه به أَجرًا، ثَالثُها: وَلَدٌ صالحٌ، أي: مؤمنٌ، يَدْعو له، وقيَّدَ الولدَ بِالصَّالحِ؛ لأنَّ الأجرَ لا يَحصُلُ مِن غيرِه، وإنَّما ذَكرَ دعاءَه تَحريضًا لِلولدِ على الدُّعاءِ لِأبيه؛ فإنَّه قيل: لِلوالدِ ثوابٌ مِن عَمَلِ الولدِ الصَّالحِ، سواءٌ دعا لِأبيه أم لا، كما أنَّ مَن غَرَسَ شَجَرةً جُعِلَ له ثَوابٌ بِأْكِل ثَمرتِها، سواءٌ دعا له الآكِلُ أم لا." +
                "في الحديثِ: الحثُّ علي الإحسانِ إلى الوالدَيْنِ بعْدَ مَوتِهما." +
                "وفيه: الحثُّ على تَعلُّمِ العِلْمِ النَّافِع وبَثِّه في النَّاسِ." +
                "وفيه: الحثُّ على التَّصدُّقِ بالصَّدقاتِ الجاريةِ. ");





        Hadeeth h2 = new Hadeeth( "عن جابر بن عبد الله -رضي الله عنه- قال: قال رسول الله صلّى الله عليه وسلم: (سلُوا اللهَ علمًا نافعًا، وتَعَوَّذُوا باللهِ منْ علمٍ لا ينفعُ)." +

                "","كان النَّبيُّ صلَّى اللهُ علَيه وسلَّم يُرشِدُ الأمَّةَ إلى ما فيه الخيرُ والصَّلاحُ والنَّفعُ في الدُّنيا والآخرَةِ." +
                "وفي هذا الحديثِ يُخبِرُ جابرُ بنُ عبدِ اللهِ رَضي اللهُ عنهما: أنَّ النَّبيَّ صلَّى اللهُ علَيه وسلَّم قال: \"سَلُوا اللهَ\"، أي: ادْعُوه واطلُبوا منه أنْ يَرزُقَكم، \"عِلمًا نافعًا\"، والعِلمُ النَّافعُ هو الَّذي يُهذِّبُ الأخلاقَ الباطِنةَ، فيَسْري إلى الأعمالِ الظَّاهرةِ، فيُصلِحُ الظَّاهرَ، والباطِنَ، والعلمُ النَّافعُ هو العِلمُ بالشَّريعةِ الَّذي يُفيدُ المكلَّفَ ما يَجِبُ عليه مِن أمورِ دِينِه في عِباداتِه، ومُعامَلاتِه، وأخلاقِه، وسلوكِه، وأَوْلى العُلومِ النَّافعةِ: العِلمُ باللهِ جلَّ شأْنُه، وأسمائِه وصفاتِه وأفعالِه، وما يجوزُ في حقِّه تعالى وما لا يَجوزُ؛ فهذا هو أعظَمُ العلومِ وأنفعُها، ومن علامَةِ إرادةِ اللهِ الخيرَ لعبدِه التَّوفيقُ لطلَبِ العلمِ وتفقُّهِه، قال النَّبيُّ صلَّى اللهُ علَيه وسلَّم: مَن يُرِدِ اللهُ به خيرًا يُفقِّهْه في الدِّينِ\" متَّفَقٌ عليه. ومِن العِلمِ النافِعِ كذلِك: العلومُ الدُّنيويَّة التي فيها فائدةٌ ومصلحةٌ للمُسلِمينَ، إذا تَعلَّمها المسلمُ وأخْلَص نيَّتَه للهِ تعالى ونفَع بها المُسلِمينَ؛ انتفع بها في الدُّنيا والآخِرةِ." +
                "ثُمَّ قال صلَّى الله عليه وسلَّم: وتعَوَّذوا باللهِ مِن علمٍ لا يَنفَعُ، أي: ادْعُوه واطْلُبوا منه أنْ يَحمِيَكم مِن أنْ يُصيبَكم علمٌ غيرُ نافِعٍ، وهو العلمُ الَّذي لا يُعمَلُ به، ولا يُنتفَعُ به، ولا يُهذِّبُ الأخلاقَ والأقوالَ والأفعالَ، ويكونُ حُجَّةً على صاحبِه، ويَدخُلُ فيه ما لم يُؤذَنْ في تعلُّمِه؛ كالعُلومِ الفاسِدةِ، مثلُ: السِّحرِ وغيرِها." +
                "وفي الحديثِ: الإرشادُ إلى طلَبِ ما يَنفَعُ مِن العِلمِ في الدِّينِ والدُّنيا والآخرةِ، والبُعدِ عن ما لا يَنفَعُ وما يَضُرُّ.");





        Hadeeth h3 = new Hadeeth( "عن أنس رضي الله عنه عن النبي صلى الله عليه وسلم أنه قال: (لا يؤمن أحدكم حتى أكون أحب إليه من والده وولده والناس أجمعين)" +

                "","مَحبَّةُ النبيِّ صلَّى اللهُ عليه وسلَّمَ مِن أُصولِ الإيمانِ، وهي مَقرونةٌ بمَحبَّةِ اللهِ عزَّ وجلَّ، وتَوعَّد اللهُ مَن قدَّم عليها شيئًا مِن الأمورِ المحبوبةِ في الطَّبْعِ؛ مِن الأقاربِ والأموالِ، والأوطان وغيرِ ذلك، فقال تعالى: {قُلْ إِنْ كَانَ آبَاؤُكُمْ وَأَبْنَاؤُكُمْ وَإِخْوَانُكُمْ وَأَزْوَاجُكُمْ وَعَشِيرَتُكُمْ وَأَمْوَالٌ اقْتَرَفْتُمُوهَا وَتِجَارَةٌ تَخْشَوْنَ كَسَادَهَا وَمَسَاكِنُ تَرْضَوْنَهَا أَحَبَّ إِلَيْكُمْ مِنَ اللَّهِ وَرَسُولِهِ وَجِهَادٍ فِي سَبِيلِهِ فَتَرَبَّصُوا حَتَّى يَأْتِيَ اللَّهُ بِأَمْرِهِ} [التوبة: 24]. ولا يكونُ المؤمنُ مُؤمنًا كاملًا حتَّى يُقدِّمَ مَحبَّةَ الرَّسولِ صلَّى اللهُ عليه وسلَّمَ على مَحبَّةِ جَميعِ الخَلْقِ، ومَحبَّةُ الرَّسولِ صلَّى اللهُ عليه وسلَّمَ تابعةٌ لمحبَّةِ مُرسِلِه سُبحانه وتعالَى. والمحبَّةُ الصَّحيحةُ تَقتضي المتابَعةَ والموافَقةَ في حبِّ المَحبوباتِ وبُغضِ المكروهاتِ؛ فالمحبَّةُ هي المُوافَقةُ في جميعِ الأحوالِ، فإذا كان هذا الحبُّ صادقًا فإنَّه لا بدَّ أنْ يَحمِلَ صاحبَه على مُتابَعةِ النبيِّ صلَّى اللهُ عليه وسلَّمَ، والعَملِ بسُنَّتِه؛ فعَلامةُ مَحبَّةِ الرَّسولِ صلَّى اللهُ عليه وسلَّمَ: أنَّه عندَ تعارُضِ طاعةِ الرَّسولِ صلَّى اللهُ عليه وسلَّمَ في أوامرِه، مع داعٍ آخَرَ يَدْعو إلى غَيرِها مِن هذه الأشياءِ المحبوبةِ، فإنْ قدَّم المرْءُ طاعةَ الرَّسولِ صلَّى اللهُ عليه وسلَّمَ وامتثالَ أوامرِه على ذلك الداعي؛ كان ذلك دَليلًا على صِحَّةِ مَحبَّتِه للرَّسولِ صلَّى اللهُ عليه وسلَّمَ، وإنْ قدَّم على طاعتِه وامتثالِ أوامرِه شيئًا مِن هذه الأشياء المحبوبةِ طَبْعًا، دلَّ ذلك على عدَمِ إتيانِه بالإيمانِ التَّامِّ الواجبِ عليه. ومِن مَحبَّتِه صلَّى اللهُ عليه وسلَّمَ نَصرُ سُنَّتِه، والذَّبُّ عن شَريعتِه، وتَمنِّي حُضورِ حَياتِه فيَبذُلَ مالَه ونفْسَه دونَه. ولا تصِحُّ هذه المحبَّةُ إلَّا بتَحقيقِ إعلاءِ قدْرِ النبيِّ صلَّى اللهُ عليه وسلَّمَ ومَنزلتِه على كلِّ والدٍ وولَدٍ، ومُحسِنٍ ومُفَضَّلٍ.وهذا الحديثُ مِن جَوامعِ الكَلِمِ؛ لأنَّ هذه الألْفاظَ اليَسيرةَ جمَعَتْ مَعانيَ كَثيرةً؛ لأنَّ أقسامَ المحبَّةِ ثلاثةٌ: مَحبَّةُ إجلالٍ وعَظَمةٍ، كمَحبَّةِ الوالدِ، ومَحبَّةُ شَفقةٍ ورَحمةٍ، كمَحبَّةِ الولَدِ، ومَحبَّةُ استحسانٍ ومُشاكَلةٍ، كمَحبَّةِ سائرِ الناسِ، فحَصَرَ أصنافَ المحبَّةِ. ");




        Hadeeth h4 = new Hadeeth("عن أبي هريرة -رضي الله عنه-، أن رسول الله -صلى الله عليه وسلم- قال: «الإيمانُ بِضْعٌ وَسَبْعُونَ أو بِضْعٌ وسِتُونَ شُعْبَةً: فَأَفْضَلُهَا قَوْلُ: لا إله إلا الله، وَأَدْنَاهَا إِمَاطَةُ الأَذَى عَنِ الطَّرِيقِ، وَالحَيَاءُ شُعْبَةٌ مِنَ الإِيمَانِ». " +

                "","الإيمان ليس خصلة واحدة، أو شعبة واحدة، ولكنه شعب كثيرة، بضع وسبعون، أو بضع وستون شعبة، ولكن أفضلها كلمة واحدة: وهي لا إله إلا الله، وأيسرها إزالة كل ما يؤذي المارين، من حجر، أو شوك، أو غير ذلك من الطريق، والحياء شعبة من الإيمان. ");




        Hadeeth h5 = new Hadeeth("(عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (إن الله يغار وغيرة الله أن يأتي المؤمنُ ما حرم عليه)"

                ,"fssfs");

        Ahadeth.add(h1);
        Ahadeth.add(h2);
        Ahadeth.add(h3);
        Ahadeth.add(h4);
        Ahadeth.add(h5);

        AhadethAdapter ahadethAdapter = new AhadethAdapter(this,0,Ahadeth);

        ListView list = findViewById(R.id.listH);
        list.setAdapter(ahadethAdapter);
        list.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> adapterView, View view, int i, long l) {
                Hadeeth item = Ahadeth.get(i);
                Intent t = new Intent(MainActivity.this,MainActivity2.class);
                t.putExtra("hadeeth",item);
                startActivity(t);

            }
        });
    }


}